BEWorkNest.LoadTests/artillery-config.yml
config:
  target: "http://localhost:5006"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
    - duration: 60
      arrivalRate: 10
      name: "Cool down"
  
  processor: "./artillery-processor.js"
  
  variables:
    keywords:
      - "developer"
      - "designer"
      - "engineer"
      - "manager"
      - "analyst"

scenarios:
  - name: "Health Check"
    weight: 10
    flow:
      - get:
          url: "/health"
          capture:
            - json: "$.status"
              as: "healthStatus"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: status

  - name: "Browse Job Posts"
    weight: 40
    flow:
      - loop:
          - get:
              url: "/api/jobpost?page={{ $randomNumber(1, 10) }}&pageSize=20"
              expect:
                - statusCode: 200
                - contentType: json
        count: 3
      - think: 2

  - name: "Search Jobs"
    weight: 30
    flow:
      - get:
          url: "/api/search?keyword={{ keywords }}"
          expect:
            - statusCode: 200
      - think: 1

  - name: "View Company Profile"
    weight: 10
    flow:
      - get:
          url: "/api/company/{{ $randomNumber(1, 100) }}"
          expect:
            - statusCode: [200, 404]
      - think: 3

  - name: "Get Analytics"
    weight: 10
    flow:
      - get:
          url: "/api/analytics/dashboard"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401]

plugins:
  expect: {}
  metrics-by-endpoint:
    stripQueryString: true
    
engines:
  http:
    timeout: 10
    maxSockets: 50